In [1]:
import pandas as pd

In [8]:
obj = pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [9]:
obj.values

array([ 4,  7, -5,  3])

In [12]:
obj2 = pd.Series([4,7,-5,3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [13]:
print(obj[2], obj2[2], obj2['a'])

-5 -5 -5

In [22]:
name = pd.Series(['Lee', 'Kim', 'Park'])
age = pd.Series([27,24,15])
friends = pd.DataFrame({'name':name, 'age': age}, columns=['name', 'age'])
friends

   name  age
0   Lee   27
1   Kim   24
2  Park   15

In [23]:
print(friends['name'], friends['age'])

0     Lee
1     Kim
2    Park
Name: name, dtype: object 0    27
1    24
2    15
Name: age, dtype: int64

In [24]:
friends.ix[0]

/Users/rainer/Dropbox/work/ml_dl/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

name    Lee
age      27
Name: 0, dtype: object

In [25]:
friends.iloc[0]

name    Lee
age      27
Name: 0, dtype: object

```python
>>> friends['job'] = 'student'
>>> friends
	name	age	job
0	Lee	27	student
1	Kim	24	student
2	Park	15	student
>>> friends.loc[friends['age'] > 19]
>>> friends
	name	age	job	adult
0	Lee	27	student	True
1	Kim	24	student	True
2	Park	15	student	False
```

In [26]:
friends['job'] = 'student'
friends

   name  age      job
0   Lee   27  student
1   Kim   24  student
2  Park   15  student

In [27]:
friends['adult'] = friends['age'] > 19

In [28]:
friends

   name  age      job  adult
0   Lee   27  student   True
1   Kim   24  student   True
2  Park   15  student  False

In [32]:
friends.loc[friends['age'] > 19]

  name  age      job  adult
0  Lee   27  student   True
1  Kim   24  student   True

In [ ]:
a